# RailingSystemSecondaryHandrailsPositionParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RailingSystemSecondaryHandrailsPositionParam Property
ParameterTypeId Class See Also
---
"Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemSecondaryHandrailsPositionParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemSecondaryHandrailsPositionParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemSecondaryHandrailsPositionParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace